mindThomas/STM32-libraries/Periphirals/STM32G4/SyncedPWMADC/SyncedPWMADC_ADC.cpp
/* Copyright (C) 2020 Thomas Jespersen, TKJ Electronics. All rights reserved.
 *
 * This program is free software: you can redistribute it and/or modify it
 * under the terms of the MIT License
 *
 * This program is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the MIT License for further details.
 *
 * Contact information
 * ------------------------------------------
 * Thomas Jespersen, TKJ Electronics
 * Web      :  http://www.tkjelectronics.dk
 * e-mail   :  thomasj@tkjelectronics.dk
 * ------------------------------------------
 */
 
#include "SyncedPWMADC.h"
#include "stm32g4xx_hal.h"
#include "Debug.h"
#include <string.h> // for memset
#include <math.h> // for roundf

// Necessary to export for compiler to generate code to be called by interrupt vector
extern "C" void DMA1_Channel1_IRQHandler(void);
extern "C" void DMA1_Channel2_IRQHandler(void);
extern "C" void ADC1_2_IRQHandler(void);

void SyncedPWMADC::ConfigureAnalogPins()
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};

    /* Peripheral clock enable */
    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();

    /**ADC1 GPIO Configuration
    PA2     ------> ADC1_IN3		[VSENSE1]
    PB1     ------> ADC1_IN12		[VSENSE3]
    PB12    ------> ADC1_IN11		[POTENTIOMETER]
    */
    GPIO_InitStruct.Pin = GPIO_PIN_12;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* Peripheral clock enable */
    __HAL_RCC_GPIOA_CLK_ENABLE();

    /**ADC2 GPIO Configuration
    PA0     ------> ADC2_IN1		[VBUS]
    PA6     ------> ADC2_IN3		[VSENSE2]
    PA4     ------> ADC2_IN17		[BEMF1]
    PC4     ------> ADC2_IN5		[BEMF2]
    PB11    ------> ADC1/2_IN14		[BEMF3]
    */
    GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_4;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_4;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    GPIO_InitStruct.Pin = GPIO_PIN_11;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* Current sense Ch1 */
    __HAL_RCC_GPIOA_CLK_ENABLE();
    /**OPAMP1 GPIO Configuration
    PA1     ------> OPAMP1_VINP
    PA2     ------> OPAMP1_VOUT
    PA3     ------> OPAMP1_VINM
    */
    GPIO_InitStruct.Pin = GPIO_PIN_1|GPIO_PIN_3;
    if (ENABLE_VSENSE1_DEBUG_OPAMP_OUTPUT) {
    	GPIO_InitStruct.Pin |= GPIO_PIN_2;
    }
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* Current sense Ch2 */
    __HAL_RCC_GPIOA_CLK_ENABLE();
    /**OPAMP2 GPIO Configuration
    PA5     ------> OPAMP2_VINM
    PA6     ------> OPAMP2_VOUT
    PA7     ------> OPAMP2_VINP
    */
    GPIO_InitStruct.Pin = GPIO_PIN_5|GPIO_PIN_7;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

    /* Current sense Ch3 */
    __HAL_RCC_GPIOB_CLK_ENABLE();
    /**OPAMP3 GPIO Configuration
    PB0     ------> OPAMP3_VINP
    PB1     ------> OPAMP3_VOUT
    PB2     ------> OPAMP3_VINM
    */
    GPIO_InitStruct.Pin = GPIO_PIN_0|GPIO_PIN_2;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);
}

void SyncedPWMADC::DeInitAnalogPins()
{
    HAL_GPIO_DeInit(GPIOA, GPIO_PIN_2);
    HAL_GPIO_DeInit(GPIOB, GPIO_PIN_1|GPIO_PIN_12);
	HAL_GPIO_DeInit(GPIOA, GPIO_PIN_0|GPIO_PIN_6);
	HAL_GPIO_DeInit(GPIOA, GPIO_PIN_1|GPIO_PIN_2|GPIO_PIN_3);
	HAL_GPIO_DeInit(GPIOA, GPIO_PIN_5|GPIO_PIN_6|GPIO_PIN_7);
	HAL_GPIO_DeInit(GPIOB, GPIO_PIN_0|GPIO_PIN_1|GPIO_PIN_2);
}

void SyncedPWMADC::InitOpAmps()
{
	OPAMP_HandleTypeDef hOpAmp = {0};

	hOpAmp.Init.PowerMode = OPAMP_POWERMODE_NORMAL;
	hOpAmp.Init.Mode = OPAMP_PGA_MODE;
	hOpAmp.Init.NonInvertingInput = OPAMP_NONINVERTINGINPUT_IO0;
	hOpAmp.Init.TimerControlledMuxmode = OPAMP_TIMERCONTROLLEDMUXMODE_DISABLE;
	hOpAmp.Init.PgaConnect = OPAMP_PGA_CONNECT_INVERTINGINPUT_IO0_BIAS;
	hOpAmp.Init.PgaGain = OPAMP_PGA_GAIN_16_OR_MINUS_15;
	hOpAmp.Init.UserTrimming = OPAMP_TRIMMING_FACTORY;
	hOpAmp.Init.InternalOutput = ENABLE;

	{
		OPAMP_HandleTypeDef handle = hOpAmp;
		handle.Instance = OPAMP1;
		if (ENABLE_VSENSE1_DEBUG_OPAMP_OUTPUT) {
			handle.Init.InternalOutput = DISABLE; // in debug mode we sample the external output
		}
		if (HAL_OPAMP_Init(&handle) != HAL_OK)
		{
			ERROR("Could not initialize OPAMP1");
		}
		if (HAL_OPAMP_Start(&handle) != HAL_OK)
		{
			ERROR("Could not start OPAMP1");
		}
	}
	{
		OPAMP_HandleTypeDef handle = hOpAmp;
		handle.Instance = OPAMP2;
		if (HAL_OPAMP_Init(&handle) != HAL_OK)
		{
			ERROR("Could not initialize OPAMP2");
		}
		if (HAL_OPAMP_Start(&handle) != HAL_OK)
		{
			ERROR("Could not start OPAMP2");
		}
	}
	{
		OPAMP_HandleTypeDef handle = hOpAmp;
		handle.Instance = OPAMP3;
		if (HAL_OPAMP_Init(&handle) != HAL_OK)
		{
			ERROR("Could not initialize OPAMP3");
		}
		if (HAL_OPAMP_Start(&handle) != HAL_OK)
		{
			ERROR("Could not start OPAMP3");
		}
	}
}

void SyncedPWMADC::DeInitOpAmps()
{
	{
		OPAMP_HandleTypeDef handle = {0};
		handle.Instance = OPAMP1;
		HAL_OPAMP_Stop(&handle);
		HAL_OPAMP_DeInit(&handle);
	}
	{
		OPAMP_HandleTypeDef handle = {0};
		handle.Instance = OPAMP2;
		HAL_OPAMP_Stop(&handle);
		HAL_OPAMP_DeInit(&handle);
	}
	{
		OPAMP_HandleTypeDef handle = {0};
		handle.Instance = OPAMP3;
		HAL_OPAMP_Stop(&handle);
		HAL_OPAMP_DeInit(&handle);
	}
}

void SyncedPWMADC::InitADCs()
{
	ADC_HandleTypeDef hADC_Config;

	/* Peripheral clock enable */
    __HAL_RCC_ADC12_CLK_ENABLE();

    /* Clock config */
    uint32_t SysClock = HAL_RCC_GetHCLKFreq();
    _ADC_Clock = SysClock / 4;
    hADC_Config.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4; // Take ADC PLL-based clock (168 MHz) and divide with this Prescaler

    /* Common config */
    hADC_Config.Init.Resolution = ADC_RESOLUTION_12B;
    hADC_Config.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    hADC_Config.Init.GainCompensation = 0;
    hADC_Config.Init.ScanConvMode = ADC_SCAN_ENABLE;
    hADC_Config.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
    hADC_Config.Init.LowPowerAutoWait = DISABLE;
    hADC_Config.Init.ContinuousConvMode = DISABLE; // Disabled since we want the Timer to trigger the sample
    hADC_Config.Init.NbrOfConversion = 1;
    hADC_Config.Init.DiscontinuousConvMode = DISABLE;
    hADC_Config.Init.ExternalTrigConv = ADC_EXTERNALTRIG_T1_TRGO2;
    hADC_Config.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
    hADC_Config.Init.DMAContinuousRequests = ENABLE;
    hADC_Config.Init.Overrun = ADC_OVR_DATA_OVERWRITTEN;

    switch (ADC_OVERSAMPLING)
    {
		case OVERSAMPLING_0:
			hADC_Config.Init.OversamplingMode = DISABLE;
			break;
		case OVERSAMPLING_2:
			hADC_Config.Init.OversamplingMode = ENABLE;
			hADC_Config.Init.Oversampling.Ratio = ADC_OVERSAMPLING_RATIO_2;
			break;
		case OVERSAMPLING_4:
			hADC_Config.Init.OversamplingMode = ENABLE;
			hADC_Config.Init.Oversampling.Ratio = ADC_OVERSAMPLING_RATIO_4;
			break;
		case OVERSAMPLING_8:
			hADC_Config.Init.OversamplingMode = ENABLE;
			hADC_Config.Init.Oversampling.Ratio = ADC_OVERSAMPLING_RATIO_8;
			break;
		case OVERSAMPLING_16:
			hADC_Config.Init.OversamplingMode = ENABLE;
			hADC_Config.Init.Oversampling.Ratio = ADC_OVERSAMPLING_RATIO_16;
			break;
    }
    hADC_Config.Init.Oversampling.RightBitShift = ADC_RIGHTBITSHIFT_2;
    hADC_Config.Init.Oversampling.TriggeredMode = ADC_TRIGGEREDMODE_SINGLE_TRIGGER;
    hADC_Config.Init.Oversampling.OversamplingStopReset = ADC_REGOVERSAMPLING_CONTINUED_MODE;

    hADC1 = hADC_Config;
    hADC1.Instance = ADC1;
	if (HAL_ADC_Init(&hADC1) != HAL_OK)
	{
		ERROR("Could not initialize ADC1");
	}

