mindThomas/STM32-libraries/Periphirals/STM32G4/SyncedPWMADC/SyncedPWMADC_ADC.cpp
		/* Set number of ranks in regular group sequencer of ADC1 */
		Channels.ADCnumChannels[0] = numberOfChannels;
		MODIFY_REG(hADC1.Instance->SQR1, ADC_SQR1_L, (numberOfChannels - (uint8_t)1));
	}


	{ /* Configure channels on ADC2 */
		numberOfChannels = 0;
		ADCidx = 2;

		{ /* Current sense 3 */
			sConfig.Channel = ADC_CHANNEL_VOPAMP3_ADC2; // Current sense 3
			Channels.VSENSE3.ADC = ADCidx;
			Channels.VSENSE3.Index = numberOfChannels;
			sConfig.Rank = ADC_ChannelIndexToADCRank(numberOfChannels);
			if (HAL_ADC_ConfigChannel(&hADC2, &sConfig) != HAL_OK)
			{
				ERROR("Could not configure channel on ADC2");
			}
			numberOfChannels++;
		}

		{ /* BEMF1 */
			sConfig.Channel = ADC_CHANNEL_17; // BEMF1
			sConfig.Rank = ADC_ChannelIndexToADCRank(numberOfChannels);
			Channels.BEMF1.ADC = ADCidx;
			Channels.BEMF1.Index = numberOfChannels;
			if (HAL_ADC_ConfigChannel(&hADC2, &sConfig) != HAL_OK)
			{
				ERROR("Could not configure channel on ADC2");
			}
			numberOfChannels++;
		}

		{ /* Vbus */
			sConfig.Channel = ADC_CHANNEL_1; // Vbus
			sConfig.Rank = ADC_ChannelIndexToADCRank(numberOfChannels);
			Channels.VBUS.ADC = ADCidx;
			Channels.VBUS.Index = numberOfChannels;
			if (HAL_ADC_ConfigChannel(&hADC2, &sConfig) != HAL_OK)
			{
				ERROR("Could not configure channel on ADC2");
			}
			numberOfChannels++;
		}

		/* Set number of ranks in regular group sequencer of ADC2 */
		Channels.ADCnumChannels[1] = numberOfChannels;
		MODIFY_REG(hADC2.Instance->SQR1, ADC_SQR1_L, (numberOfChannels - (uint8_t)1));
	}


	if (Channels.ADCnumChannels[0] > Channels.ADCnumChannels[1]) {
		_ADC_SampleTime_Total_us = Channels.ADCnumChannels[0] * ADC_SampleTime_SingleChannel_us;
		if ((ADC_DMA_HALFWORD_MAX_BUFFER_SIZE % Channels.ADCnumChannels[0]) > 0) {
			ERROR("DMA buffer size is not a multiple of the number of channels to sample");
		}
	} else {
		_ADC_SampleTime_Total_us = Channels.ADCnumChannels[1] * ADC_SampleTime_SingleChannel_us;
		if ((ADC_DMA_HALFWORD_MAX_BUFFER_SIZE % Channels.ADCnumChannels[1]) > 0) {
			ERROR("DMA buffer size is not a multiple of the number of channels to sample");
		}
	}

	xSemaphoreGive( _timerSettingsMutex ); // unlock settings

	if (ShouldRestart) {
		StartSampling();
	}
}

uint32_t SyncedPWMADC::ADC_ChannelIndexToADCRank(uint8_t chIndex)
{
	switch (chIndex) {
		case 0: return ADC_REGULAR_RANK_1;
		case 1: return ADC_REGULAR_RANK_2;
		case 2: return ADC_REGULAR_RANK_3;
		case 3: return ADC_REGULAR_RANK_4;
		case 4: return ADC_REGULAR_RANK_5;
		case 5: return ADC_REGULAR_RANK_6;
		case 6: return ADC_REGULAR_RANK_7;
		case 7: return ADC_REGULAR_RANK_8;
		case 8: return ADC_REGULAR_RANK_9;
		case 9: return ADC_REGULAR_RANK_10;
		case 10: return ADC_REGULAR_RANK_11;
		case 11: return ADC_REGULAR_RANK_12;
		case 12: return ADC_REGULAR_RANK_13;
		case 13: return ADC_REGULAR_RANK_14;
		case 14: return ADC_REGULAR_RANK_15;
		case 15: return ADC_REGULAR_RANK_16;
		default: return 0; // error
	}
}

void SyncedPWMADC::DeInitADCs()
{
	__HAL_RCC_ADC12_CLK_DISABLE();
}

void SyncedPWMADC::InitDMAs()
{
	/* DMA controller clock enable */
	__HAL_RCC_DMAMUX1_CLK_ENABLE();
	__HAL_RCC_DMA1_CLK_ENABLE();

    /* ADC1 DMA Init */
    /* ADC1 Init */
	hDMA_ADC1.Instance = DMA1_Channel1;
    hDMA_ADC1.Init.Request = DMA_REQUEST_ADC1;
    hDMA_ADC1.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hDMA_ADC1.Init.PeriphInc = DMA_PINC_DISABLE;
    hDMA_ADC1.Init.MemInc = DMA_MINC_ENABLE;
    hDMA_ADC1.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    hDMA_ADC1.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    hDMA_ADC1.Init.Mode = DMA_NORMAL;
    hDMA_ADC1.Init.Priority = DMA_PRIORITY_VERY_HIGH;

    if (!SAMPLE_IN_EVERY_PWM_CYCLE) {
    	hDMA_ADC1.Init.Mode = DMA_NORMAL; // wait for DMA to be started/triggered and the fill the buffer ONCE
    } else {
    	hDMA_ADC1.Init.Mode = DMA_CIRCULAR; // we want to sample at every PWM period, so it should just run continuously in a circular fashion
    	timerSettingsNext.samplingInterval = 1;
    	timerSettingsNext.samplingAveragingNumSamples = 1;
    }

    if (HAL_DMA_Init(&hDMA_ADC1) != HAL_OK)
    {
    	ERROR("Could not initialize ADC1 DMA");
    }

    __HAL_LINKDMA(&hADC1, DMA_Handle, hDMA_ADC1);

    /* ADC2 DMA Init */
    /* ADC2 Init */
    hDMA_ADC2.Instance = DMA1_Channel2;
    hDMA_ADC2.Init.Request = DMA_REQUEST_ADC2;
    hDMA_ADC2.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hDMA_ADC2.Init.PeriphInc = DMA_PINC_DISABLE;
    hDMA_ADC2.Init.MemInc = DMA_MINC_ENABLE;
    hDMA_ADC2.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    hDMA_ADC2.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    hDMA_ADC2.Init.Priority = DMA_PRIORITY_VERY_HIGH;

    if (!SAMPLE_IN_EVERY_PWM_CYCLE) {
    	hDMA_ADC2.Init.Mode = DMA_NORMAL; // wait for DMA to be started/triggered and the fill the buffer ONCE
    } else {
    	hDMA_ADC2.Init.Mode = DMA_CIRCULAR; // we want to sample at every PWM period, so it should just run continuously in a circular fashion
    	timerSettingsNext.samplingInterval = 1;
    	timerSettingsNext.samplingAveragingNumSamples = 1;
    }

    if (HAL_DMA_Init(&hDMA_ADC2) != HAL_OK)
    {
    	ERROR("Could not initialize ADC2 DMA");
    }

    __HAL_LINKDMA(&hADC2, DMA_Handle, hDMA_ADC2);

	/* DMA interrupt init */
	/* DMA1_Channel1_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(DMA1_Channel1_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ(DMA1_Channel1_IRQn);

	HAL_NVIC_SetPriority(DMA1_Channel2_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ(DMA1_Channel2_IRQn);
}

void SyncedPWMADC::DeInitDMAs()
{
	HAL_DMA_DeInit(hADC1.DMA_Handle);
	HAL_DMA_DeInit(hADC1.DMA_Handle);
}

void SyncedPWMADC::StartADC()
{
	if (_ADCEnabled) return; // ADC already running
	_ADCEnabled = true;

	ADC_Start(&hADC1);
	ADC_Start(&hADC2);
}


void SyncedPWMADC::StopADC()
{
	if (!_ADCEnabled) return; // sampling already stopped
	_ADCEnabled = false;

	LL_ADC_REG_StopConversion(hADC1.Instance);
	LL_ADC_REG_StopConversion(hADC2.Instance);

	ADC_Stop(&hADC1);
	ADC_Stop(&hADC2);
}

void SyncedPWMADC::ADC_Start(ADC_HandleTypeDef * hadc)
{
	// Based on "HAL_ADC_Start_DMA"
	/* Perform ADC enable and conversion start if no conversion is on going */
	if (LL_ADC_REG_IsConversionOngoing(hadc->Instance) == 0UL)
	{
		/* Start conversion if ADC is effectively enabled */
		if (ADC_Enable(hadc) == HAL_OK)
		{
	        /* Set ADC state                                                        */
	        /* - Clear state bitfield related to regular group conversion results   */
	        /* - Set state bitfield related to regular operation                    */
			ADC_STATE_CLR_SET(hadc->State,
							  HAL_ADC_STATE_READY | HAL_ADC_STATE_REG_EOC | HAL_ADC_STATE_REG_OVR | HAL_ADC_STATE_REG_EOSMP,
							  HAL_ADC_STATE_REG_BUSY);

			CLEAR_BIT(hadc->State, HAL_ADC_STATE_MULTIMODE_SLAVE);

