mindThomas/STM32-libraries/Periphirals/STM32G4/SyncedPWMADC/SyncedPWMADC_ADC.cpp
			ADC_CLEAR_ERRORCODE(hadc);


			/* Set the DMA transfer complete callback */
			hadc->DMA_Handle->XferCpltCallback = ADC_DMAConvCplt;

			/* Set the DMA half transfer complete callback */
			hadc->DMA_Handle->XferHalfCpltCallback = ADC_DMAHalfConvCplt;

			/* Set the DMA error callback */
			hadc->DMA_Handle->XferErrorCallback = ADC_DMAError;

			/* Clear regular group conversion flag and overrun flag               */
			__HAL_ADC_CLEAR_FLAG(hadc, (ADC_FLAG_EOC | ADC_FLAG_EOS | ADC_FLAG_OVR));

			/* Start ADC group regular conversion */
			//LL_ADC_REG_StartConversion(hadc->Instance);
		} else {
			ERROR("Could not start ADC");
		}
	} else {
		ERROR("Could not start ADC");
	}
}

void SyncedPWMADC::ADC_Stop(ADC_HandleTypeDef * hadc)
{
	/* 1. Stop potential ADC group regular conversion on going */
	/* And Disable ADC peripheral if conversions are effectively stopped */
	if (ADC_ConversionStop(hadc, ADC_REGULAR_INJECTED_GROUP) == HAL_OK)
	{
		/* Disable ADC DMA (ADC DMA configuration of continous requests is kept) */
		CLEAR_BIT(hadc->Instance->CFGR, ADC_CFGR_DMAEN);

		/* Disable ADC overrun interrupt */
		__HAL_ADC_DISABLE_IT(hadc, ADC_IT_OVR);

		/* 2. Disable the ADC peripheral */
		/* And Check if ADC is effectively disabled */
		if (ADC_Disable(hadc) == HAL_OK)
		{
			/* Set ADC state */
			ADC_STATE_CLR_SET(hadc->State,
							  HAL_ADC_STATE_REG_BUSY | HAL_ADC_STATE_INJ_BUSY,
							  HAL_ADC_STATE_READY);
		}
	} else {
		ERROR("Could not stop ADC");
	}
}

void SyncedPWMADC::StartSampling()
{
	if (!_ADCEnabled) { // ADCs not enabled
		StartADC();
	}

	// Enable the sampling synchronized to the timer
	__HAL_TIM_CLEAR_IT(&hTimer, TIM_IT_UPDATE); // important to clear the interrupt before enabling since the update flag might be set without the interrupt having been enabled, and thus the interrupt would end up firing right after enabling it
	__HAL_TIM_ENABLE_IT(&hTimer, TIM_IT_UPDATE);
}

void SyncedPWMADC::StopSampling()
{
	// Disable the sampling synchronized to the timer
	__HAL_TIM_DISABLE_IT(&hTimer, TIM_IT_UPDATE);

	if (!_SamplingEnabled) return; // sampling already stopped

	if (_ADCEnabled) { // Stop the enabled ADCs
		StopADC();
	}

	/* Disable ADC DMA (ADC DMA configuration of continous requests is kept) */
	CLEAR_BIT(hADC1.Instance->CFGR, ADC_CFGR_DMAEN);
	CLEAR_BIT(hADC2.Instance->CFGR, ADC_CFGR_DMAEN);

	_SamplingEnabled = false;

	if (hDMA_ADC1.State != HAL_DMA_STATE_READY) {
		HAL_DMA_Abort(&hDMA_ADC1);
	}
	if (hDMA_ADC2.State != HAL_DMA_STATE_READY) {
		HAL_DMA_Abort(&hDMA_ADC2);
	}

    __HAL_ADC_CLEAR_FLAG(&hADC1, (ADC_FLAG_EOC | ADC_FLAG_EOS | ADC_FLAG_OVR));
    __HAL_ADC_CLEAR_FLAG(&hADC2, (ADC_FLAG_EOC | ADC_FLAG_EOS | ADC_FLAG_OVR));

    _DMA_ADC1_ongoing = 0;
    _DMA_ADC2_ongoing = 0;
}

void SyncedPWMADC::RestartSampling()
{
	if (_SamplingEnabled)
	{
		StopSampling();
		StartSampling();
	}
}

// Not used in DMA mode. So this interrupt would generally not be called
void ADC1_2_IRQHandler(void)
{
	if (SyncedPWMADC::globalObject) {
		  HAL_ADC_IRQHandler(&SyncedPWMADC::globalObject->hADC1);
		  HAL_ADC_IRQHandler(&SyncedPWMADC::globalObject->hADC2);
	}
}

void DMA1_Channel1_IRQHandler(void)
{
	if (SyncedPWMADC::globalObject)
		HAL_DMA_IRQHandler(&SyncedPWMADC::globalObject->hDMA_ADC1); // The HAL interrupt routine called here is fast, so it's OK to use it.
}

void DMA1_Channel2_IRQHandler(void)
{
	if (SyncedPWMADC::globalObject)
		HAL_DMA_IRQHandler(&SyncedPWMADC::globalObject->hDMA_ADC2); // The HAL interrupt routine called here is fast, so it's OK to use it.
}
